//Даны 2 целых числа: A и B. Требуется вычислить их сумму.
import java.util.Scanner;

public class AplusB {

	public static void main(String[] args) {
		Scanner scanner = new Scanner(System.in);
		int a = scanner.nextInt();
		int b = scanner.nextInt();
		System.out.println(a + b);
	}

}
//Дано целое положительное число N. Выведите его последнюю цифру.
import java.util.Scanner;

public class AplusB {

	public static void main(String[] args) {
		Scanner scanner = new Scanner(System.in);
		int a = scanner.nextInt();
		System.out.println(a % 10);
	}

}
//Дано трехзначное число N. Найдите сумму его цифр.
import java.util.Scanner;

public class AplusB {

	public static void main(String[] args) {
		Scanner scanner = new Scanner(System.in);
		int a = scanner.nextInt();
		int b = a /100;
		int c = a % 100 / 10;
		int d = a % 100 % 10;
		int s = b + c + d;
		System.out.println(s);
	}

}
//Дано целое положительное число N. Выведите следующее за ним четное число. При решении этой задачи нельзя использовать условную инструкцию if и циклы.
import java.util.Scanner;

public class AplusB {

	public static void main(String[] args) {
		Scanner scanner = new Scanner(System.in);
		int a = scanner.nextInt();
		int b = a - a % 2 + 2;
		System.out.println(b);
	}

}
//Пирожок в столовой стоит a рублей и b копеек. Определите, сколько рублей и копеек нужно заплатить за n пирожков.
import java.util.Scanner;

public class AplusB {

	public static void main(String[] args) {
		Scanner scanner = new Scanner(System.in);
		int a = scanner.nextInt(); 
        int b = scanner.nextInt();
        int n = scanner.nextInt();
		System.out.println((a * n + (b * n) / 100) + " " + (b * n) % 100);
	}

}
//Электронные часы показывают время в формате h:mm:ss, то есть сначала записывается количество часов, потом обязательно двузначное количество минут, затем обязательно двузначное количество секунд. Количество минут и секунд при необходимости дополняются до двузначного числа нулями.

С начала суток прошло n секунд. Выведите, что покажут часы.
import java.util.Scanner;

public class Main {
    public static void main(String[] args) {
        Scanner in = new Scanner(System.in);
        long n,h,m,s;
        n = in.nextLong();
        h = (n %(3600*24)) /3600;
        m = (n % 3600) / 60;
        s = (n % 60);
        if (m<10){
            if (s<10){
                System.out.println(h+ ":0" +m+ ":0"+s);
            }
            else {
                System.out.println(h+ ":0" +m+ ":"+s);
            }

        }
        else {
            if (s<10){
                System.out.println(h+ ":" +m+ ":0"+s);
            }
            else if(s>10){
                System.out.println(h+ ":" +m+ ":"+s);
            }

        }
    }
}
//Дано целое неотрицательное число N. Требуется определить младшую цифру в десятичной записи числа N
import java.util.Scanner;

public class Main {
    public static void main(String[] args) {
        Scanner in = new Scanner(System.in);
        long a, b, c ;
        a = in.nextLong();
        b = 10;
        c =-10;
        if (a %10> c){
            c = a% 10;
        }
        if (a % 10 < b){
            b = a % 10;
            a = a / 10;
        }
        System.out.println(c);
    }

}
//Дано двухзначное натуральное число N. Требуется определить количество десятков в десятичной записи числа N.
import java.util.Scanner;

public class Main {
    public static void main(String[] args) {
        Scanner in = new Scanner(System.in);
        long n,a;
        n = in.nextLong();
        a = n /10;

                System.out.println(a);
            }

        }
//Дано трехзначное натуральное число N. Требуется определить сумму цифр в десятичной записи числа N.
import java.util.Scanner;

public class Main {
    public static void main(String[] args) {
        Scanner in = new Scanner(System.in);
        long n,a, b, c;
        n = in.nextLong();
        a = n /100;
        b = n %100/10;
        c = n%100%10;

                System.out.println(a+b+c);
            }

        }
//Дан прямоугольник со сторонами A и B. Требуется вычислить квадрат диагонали прямоугольника
import java.util.Scanner;

public class Main {
    public static void main(String[] args) {
        Scanner in = new Scanner(System.in);
        long a;
        long b;
        double c;
        a = in.nextLong();
        b = in.nextLong();
        c =  Math.sqrt(a*a + b*b);


                System.out.println(Math.round(c*c));
            }

        }
