//Проверить, является ли символ цифрой
//102 на informatics
//Напишите функцию boolean IsDigit(char c) (Java), function IsDigit(c:char):boolean (Pascal), bool IsDigit(unsigned char c) (C/C++), определяющую, является ли данный символ цифрой или нет.
//Естественно, программа должна считывать данные, вызывать эту функцию и выдавать ответ.


//Изменить регистр символа
//Дан символ C из таблицы кодировки ASCII. Измените регистр символа, если он был латинской буквой: сделайте его заглавным, если он был строчной буквой и наоборот. Для этого напишите отдельную функцию, меняющую регистр символа.



//Количество слов
//Дана строка s, содержащая буквы латинского алфавита в верхнем и нижнем регистре, а также пробелы. Найдите, количество слов в строке s. Словом считается последовательность непробельных символов.


//Самое длинное слово
//Дана строка s, содержащая буквы латинского алфавита в верхнем и нижнем регистре, а также пробелы. Найдите самое длинное слово в строке s, выведите это слово и его длину. Если таких слов несколько, выведите первое из них.
//Словом считается последовательность непробельных символов.


//Является ли слово палиндромом?
//По данной строке s определите, является ли она палиндромом (то есть, можно ли прочесть ее наоборот, как, например, слово "топот").


//Две одинаковые буквы
//Дана строка S. Известно, что она содержит ровно две одинаковые буквы. Найдите эти буквы. Гарантируется, что повторяются буквы только одного вида.



//Капитан Флинт
//Капитан Флинт зарыл клад на Острове сокровищ. Он оставил описание, как найти клад. Описание состоит из строк вида: "Direction n", где Direction – одно из слов "North", "South", "East", "West" – задает направление движения, а n – количество шагов, которое необходимо пройти в этом направлении.
//Напишите программу, которая по описанию пути к кладу определяет точные координаты клада, считая, что начало координат находится в начале пути, ось OX направлена на восток, ось OY – на север.



//Является ли строка палиндромом?
//Дана строка s, состоящая из строчных латинских букв и пробелов. Проверьте, является ли она палиндромом без учета пробелов (например, Лёша на полке клопа нашёл).


//Шифр Юлия
//Юлий Цезарь использовал свой способ шифрования текста. Каждая буква заменялась на следующую по алфавиту через K позиций по кругу. Необходимо по заданной шифровке определить исходный текст.


//Удали пробелы
//Дана строка s, требуется преобразовать все идущие подряд пробелы в один.
